app/Http/Controllers/CartController.php

    public function updateCampaignProduct(Request $request)
    {
        if (session_status() !== PHP_SESSION_ACTIVE) {
            session_start();
        }

        $request->validate([
            'campaign_id' => 'required|integer|exists:campaigns,id',
            'product_id' => 'required|integer|exists:products,id',
            'selected' => 'required|in:0,1',
        ]);

        $campaign = Campaign::with(['products.options', 'products.colors', 'product.options', 'product.colors'])
            ->findOrFail((int) $request->input('campaign_id'));

        $campaignProducts = $campaign->products;
        if ($campaignProducts->isEmpty() && $campaign->product) {
            $campaignProducts = collect([$campaign->product]);
        }

        $productId = (int) $request->input('product_id');
        $campaignProduct = $campaignProducts->firstWhere('id', $productId);
---
select * from `campaigns` where `campaigns`.`id` = 1 limit 1
select `colors`.*, `color_product`.`product_id` as `pivot_product_id`, `color_product`.`color_id` as `pivot_color_id`, `color_product`.`created_at` as `pivot_created_at`, `color_product`.`updated_at` as `pivot_updated_at` from `colors` inner join `color_product` on `colors`.`id` = `color_product`.`color_id` where `color_product`.`product_id` in (1, 2)
select `options`.*, `option_product`.`product_id` as `pivot_product_id`, `option_product`.`option_id` as `pivot_option_id`, `option_product`.`price` as `pivot_price`, `option_product`.`created_at` as `pivot_created_at`, `option_product`.`updated_at` as `pivot_updated_at` from `options` inner join `option_product` on `options`.`id` = `option_product`.`option_id` where `option_product`.`product_id` in (1, 2)
select * from `products` where `products`.`id` in (1)

        });

        if ($selected && !$existingCartItem) {
            $selectedOption = $campaignProduct->options->first();
---
select `options`.*, `option_product`.`product_id` as `pivot_product_id`, `option_product`.`option_id` as `pivot_option_id`, `option_product`.`price` as `pivot_price`, `option_product`.`created_at` as `pivot_created_at`, `option_product`.`updated_at` as `pivot_updated_at` from `options` inner join `option_product` on `options`.`id` = `option_product`.`option_id` where `option_product`.`product_id` in (1)