app/Http/Controllers/WebsiteController.php

    public function campaign($slug)
    {
        $campaign_data = Campaign::with(['products.options', 'products.colors', 'product.options', 'product.colors'])
            ->where('slug', $slug)
            ->first();

        if (!$campaign_data) {
            abort(404);
        }

        if (session_status() !== PHP_SESSION_ACTIVE) {
            session_start();
        }

        $charge = ShippingCharge::first();
---
select * from `campaigns` where `slug` = 'test' limit 1
select * from `products` where `products`.`id` in (1)
select `colors`.*, `color_product`.`product_id` as `pivot_product_id`, `color_product`.`color_id` as `pivot_color_id`, `color_product`.`created_at` as `pivot_created_at`, `color_product`.`updated_at` as `pivot_updated_at` from `colors` inner join `color_product` on `colors`.`id` = `color_product`.`color_id` where `color_product`.`product_id` in (1, 2)
select `options`.*, `option_product`.`product_id` as `pivot_product_id`, `option_product`.`option_id` as `pivot_option_id`, `option_product`.`price` as `pivot_price`, `option_product`.`created_at` as `pivot_created_at`, `option_product`.`updated_at` as `pivot_updated_at` from `options` inner join `option_product` on `options`.`id` = `option_product`.`option_id` where `option_product`.`product_id` in (1, 2)
select * from `shipping_charges` limit 1