app/Http/Controllers/Admin/CampaignController.php

    public function index()
    {
        $campaigns = Campaign::all();
---
select * from `campaigns`