app/Http/Controllers/Admin/DashboardController.php

    public function getData(Request $request)
    {
        $date = explode(' to ',$request['date']);

        $startDate = $date[0];
        if(isset($date[1])){

            $endDate = $date[1];

        }else{
            $endDate = $date[0];
        }

        $response['revenue'] = DB::table("orders")->where('orders.status','like','Paid')->sum("subTotal");
        $response['allOrders'] = DB::table('orders')->where('deleted_at',null)->count();
        $response['all'] = DB::table('orders')->where('deleted_at',null)->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->count();
        $response['Incomplete'] = DB::table('orders')->where('deleted_at',null)->where('status','like','Incomplete')->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->count();
        $response['processing'] = DB::table('orders')->where('deleted_at',null)->where('status','like','Processing')->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->count();
        $response['pendingPayment'] = DB::table('orders')->where('deleted_at',null)->where('status','like','Payment Pending')->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->count();
        $response['onHold'] = DB::table('orders')->where('deleted_at',null)->where('status','like','On Hold')->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->count();
        $response['canceled'] = DB::table('orders')->where('deleted_at',null)->where('status','like','Canceled')->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->count();
        $response['completed'] = DB::table('orders')->where('deleted_at',null)->where('status','like','Completed')->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->count();
        $response['pendingInvoiced'] = DB::table('orders')->where('deleted_at',null)->where('status','like','Completed')->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->orWhere('orders.status', 'like', 'Pending Invoiced')->count();
        $response['invoiced'] = DB::table('orders')->where('deleted_at',null)->where('status','like','Invoiced')->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->count();
        $response['stockOut'] =  DB::table('orders')->where('deleted_at',null)->where('status','like','Stock Out')->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->count();
        $response['delivered'] = DB::table('orders')->where('deleted_at',null)->where('status','like','Delivered')->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->count();
        $response['customerConfirm'] =  DB::table('orders')->where('deleted_at',null)->where('status','like','Customer Confirm')->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->count();
        $response['paid'] = DB::table('orders')->where('deleted_at',null)->where('status','like','Paid')->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->count();
        $response['return'] = DB::table('orders')->where('deleted_at',null)->where('status','like','Return')->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->count();
        $response['lost'] = DB::table('orders')->where('deleted_at',null)->where('status','like','Lost')->whereBetween('orders.updated_at', [$startDate.' 00:00:00',$endDate.' 23:59:59'])->count();
        $response['store'] =  DB::table("stores")->get()->count();
        $response['user'] = DB::table("users")->where('role_id','=','3')->get()->count();
---
select sum(`subTotal`) as aggregate from `orders` where `orders`.`status` like 'Paid'
select count(*) as aggregate from `orders` where `deleted_at` is null
select count(*) as aggregate from `orders` where `deleted_at` is null and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59'
select count(*) as aggregate from `orders` where `deleted_at` is null and `status` like 'Incomplete' and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59'
select count(*) as aggregate from `orders` where `deleted_at` is null and `status` like 'Processing' and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59'
select count(*) as aggregate from `orders` where `deleted_at` is null and `status` like 'Payment Pending' and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59'
select count(*) as aggregate from `orders` where `deleted_at` is null and `status` like 'On Hold' and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59'
select count(*) as aggregate from `orders` where `deleted_at` is null and `status` like 'Canceled' and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59'
select count(*) as aggregate from `orders` where `deleted_at` is null and `status` like 'Completed' and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59'
select count(*) as aggregate from `orders` where `deleted_at` is null and `status` like 'Completed' and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59' or `orders`.`status` like 'Pending Invoiced'
select count(*) as aggregate from `orders` where `deleted_at` is null and `status` like 'Invoiced' and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59'
select count(*) as aggregate from `orders` where `deleted_at` is null and `status` like 'Stock Out' and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59'
select count(*) as aggregate from `orders` where `deleted_at` is null and `status` like 'Delivered' and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59'
select count(*) as aggregate from `orders` where `deleted_at` is null and `status` like 'Customer Confirm' and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59'
select count(*) as aggregate from `orders` where `deleted_at` is null and `status` like 'Paid' and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59'
select count(*) as aggregate from `orders` where `deleted_at` is null and `status` like 'Return' and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59'
select count(*) as aggregate from `orders` where `deleted_at` is null and `status` like 'Lost' and `orders`.`updated_at` between '2026-09-15 00:00:00' and '2026-09-15 23:59:59'
select * from `stores`
select * from `users` where `role_id` = '3'

    public function getNotification()
    {
        $notifications = DB::table('notifications')->leftjoin('users', 'notifications.user_id', '=', 'users.id')->select('notifications.*','users.name')->where('notifications.status','=','0')->latest('notifications.id')->first();
---
select `notifications`.*, `users`.`name` from `notifications` left join `users` on `notifications`.`user_id` = `users`.`id` where `notifications`.`status` = '0' order by `notifications`.`id` desc limit 1