app/Http/Controllers/Admin/MediaController.php

select * from `media` order by `created_at` desc
---
    public function create()
    {
        return datatables()->of(Media::latest()->get())
            ->addColumn('image', function(Media $media) {
                return '<img src="'.asset('/public/product/thumbnail/'.$media->url).'" alt="image" class="img-fluid avatar-md rounded">';
            })
            ->addColumn('created_at', function(Media $media) {
                return  Carbon::parse($media->created_at)->diffForHumans();
            })
            ->addColumn('action', function(Media $media) {
                return "<a href='javascript:void(0);' data-id='" .$media->id."' class='action-icon btn-edit'> <i class='fas fa-1x fa-edit'></i></a>
                    <a href='javascript:void(0);' data-id='" .$media->id. "' class='action-icon btn-delete'> <i class='fas fa-trash-alt'></i></a>";
            })
            ->only(['id','name','image','created_at','action'])
            ->escapeColumns([])->toJson();