app/Http/Controllers/Admin/OrderController.php

select * from `orders` where `id` in ('11') and `orders`.`deleted_at` is null
select * from `customers` where `order_id` = 11 and `customers`.`deleted_at` is null limit 1
select * from `order_products` where `order_id` = 11 and `order_products`.`deleted_at` is null
---
    public function forceDelete($id)
    {
        // Retrieve the soft-deleted order using the ID
        $order = Order::onlyTrashed()->findOrFail($id);

        // Retrieve the soft-deleted customer associated with the order
        $customer = Customer::onlyTrashed()->where('order_id', $order->id)->first();
        if ($customer) {
            $customer->forceDelete();
        }

        // Retrieve the soft-deleted order products associated with the order
        $orderProducts = OrderProducts::onlyTrashed()->where('order_id', $order->id)->get();