app/Http/Controllers/Admin/ProductController.php

    public function category(Request $request)
    {
        if(isset($request['q'])){
            $couriers = Category::query()->where('categoryName','like','%'.$request['q'].'%')->get();
        }else{
            $couriers = Category::all();
---
select * from `categories`

   public function size(Request $request)
    {
        if (isset($request['q'])) {
            $sizes = Size::query()->where('sizeName', 'like', '%' . $request['q'] . '%')->get();
        } else {
            $sizes = Size::all();
---
select * from `sizes`

    public function color(Request $request)
    {
        if (isset($request['q'])) {
            $colors = Color::query()->where('colorName', 'like', '%' . $request['q'] . '%')->get();
        } else {
            $colors = Color::all();
---
select * from `colors`